Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus 2.11.1.Final and 2.10.4.Final released - Fixing CVE-2022-2466, new Redis Client API, more customization for some core extensions and more
ja_jp: Quarkus 2.11.1.Final と 2.10.4.Final をリリース - CVE-2022-2466 の修正、新しい Redis クライアント API、一部のコアエクステンションのカスタマイズ機能など

source: Quarkus 2.12 is a relatively small release, with most development happening in August and all.
ja_jp: Quarkus 2.12は比較的小さなリリースで、ほとんどの開発は8月に行われたものです。

source: Quarkus 2.12.0.Final released - GraalVM/Mandrel 22.2, Kotlin 1.7
ja_jp: Quarkus 2.12.0.Final リリース - GraalVM/Mandrel 22.2、Kotlin 1.7

source: Quarkus 2.13.0.Final introduces a brand new Kafka Dev UI. It brings several exciting features allowing you to manage your Kafka instance from Dev UI.
ja_jp: Quarkus 2.13.0.Finalでは、まったく新しいKafka Dev UIが導入されました。これにより、Dev UIからKafkaインスタンスを管理できるようになり、いくつかのエキサイティングな機能が追加されました。

source: Quarkus 2.13.0.Final released - Cross site request forgery prevention filter, Kafka Dev UI
ja_jp: Quarkus 2.13.0.Finalリリース - クロスサイトリクエストフォージェリ防止フィルター、Kafka Dev UI

source: Quarkus 2.14.0.Final is still targeting GraalVM/Mandrel 22.2 but an upgrade to 22.3 is planned for Quarkus 2.14.1.Final, which will be released next week.
ja_jp: Quarkus 2.14.0.Final はまだ GraalVM/Mandrel 22.2 をターゲットにしていますが、来週リリースされる Quarkus 2.14.1.Final では 22.3 へのアップグレードが予定されています。

source: Quarkus 2.14.0.Final released - Jandex 3, new Redis commands, caching annotations for Infinispan
ja_jp: Quarkus 2.14.0.Final リリース - Jandex 3、新しいRedisコマンド、Infinispan用キャッシングアノテーション

source: Quarkus 2.2 includes a new dispatching strategy to make RESTEasy Reactive even better.
ja_jp: Quarkus 2.2では、RESTEasy Reactive のディスパッチ戦略がよりスマートになり、開発者のエクスペリエンスが向上しました。

source: Quarkus 2.2.1.Final released - Hardening release
ja_jp: Quarkus 2.2.1.Finalリリース - ハードニングリリース

source: Quarkus 2.2.2.Final released - Maintenance release
ja_jp: Quarkus 2.2.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.2.3.Final released - Maintenance release
ja_jp: Quarkus 2.2.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.3 brings new features and a host of refinements and improvements across the board.
ja_jp: Quarkus 2.3は、新機能と、全体的に多くの改良と改善が含まれています。

source: Quarkus 2.3.0.Final released - Dev Service for Neo4J, Logging with Panache, Testing CLI applications and much more
ja_jp: Quarkus 2.3.0.Final リリース - Neo4J向けDev Service、Panacheによるログ取得、CLIアプリケーションのテスト、他多数

source: Quarkus 2.3.1.Final released - Maintenance release
ja_jp: Quarkus 2.3.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.4 brings new features and a host of refinements and improvements across the board.
ja_jp: Quarkus 2.4は、新機能と、全体的に多くの改良と改善が含まれています。

source: Quarkus 2.4.0.Final released - Hibernate Reactive 1.0.0, Kafka Streams DevUI, Multi module continuous testing, AWT image resize via new AWT extension and much more
ja_jp: Quarkus 2.4.0.Finalリリース - Hibernate Reactive 1.0.0, Kafka Streams DevUI, マルチモジュール継続的テスト, 新しいAWTエクステンションによるAWT イメージリサイズ等々

source: Quarkus 2.4.1.Final released - Maintenance release
ja_jp: Quarkus 2.4.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.4.2.Final released - Maintenance release
ja_jp: Quarkus 2.4.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.5 adds support for JPA entity listeners, including in native mode.
ja_jp: Quarkus 2.5では、ネイティブモードを含め、JPAエンティティリスナーのサポートが追加されました。

source: Quarkus 2.5 introduces the `quarkus:go-offline` goal to cover this requirement.
ja_jp: Quarkus 2.5では、この要件をカバーするために `quarkus:go-offline` ゴールを導入しています。

source: Quarkus 2.5 supports these providers as explained in the link:/guides/security-openid-connect-web-authentication#integration-with-github-and-other-oauth2-providers[Using OpenID Connect (OIDC) to Protect Web Applications using Authorization Code Flow] guide.
ja_jp: Quarkus 2.5は、 link:/guides/security-openid-connect-web-authentication#integration-with-github-and-other-oauth2-providers[OpenID Connect (OIDC) 認可コードフローを用いたWebアプリケーションの保護] で説明されているように、これらのプロバイダーをサポートしています。

source: Quarkus 2.5.0.Final recommends GraalVM/Mandrel 21.3 and introduces usability improvements in many extensions.
ja_jp: Quarkus 2.5.0.Final は GraalVM/Mandrel 21.3 を推奨し、多くのエクステンションで使い勝手が改善されています。

source: Quarkus 2.5.0.Final released - GraalVM/Mandrel 21.3 and usability improvements all over the place
ja_jp: Quarkus 2.5.0.Final リリース - GraalVM/Mandrel 21.3とユーザビリティの全面的な改善

source: Quarkus 2.5.1.Final released - Maintenance release
ja_jp: Quarkus 2.5.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.5.2.Final released - Maintenance release
ja_jp: Quarkus 2.5.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.5.3.Final released - Maintenance release
ja_jp: Quarkus 2.5.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.5.4.Final released - Maintenance release
ja_jp: Quarkus 2.5.4.Finalリリース - メンテナンスリリース

source: Quarkus 2.6 adds support for built-in UPX compression of native executables. While it has some advantages, be aware it comes at a cost. Clément explained it at length in https://quarkus.io/blog/upx/[his dedicated blog post].
ja_jp: Quarkus 2.6では、ネイティブ実行可能ファイルの組込UPX圧縮のサポートが追加されました。この機能にはいくつかの利点がありますが、コストがかかることに注意してください。Clément氏が link:https://quarkus.io/blog/upx/[専用のブログ記事]で詳しく説明しています。

source: Quarkus 2.6.0.Final comes with SmallRye Reactive Messaging 3.13 and Kafka 3, a programmatic API for caching, an AWT extension, Kotlin 1.6 support, Camel 3.14 and more.
ja_jp: Quarkus 2.6.0.Finalには、SmallRye Reactive Messaging 3.13とKafka 3、キャッシングのためのプログラムAPI、AWTエクステンション、Kotlin 1.6のサポート、Camel 3.14など多数が含まれています。

source: Quarkus 2.6.0.Final released - SmallRye Reactive Messaging 3.13 and Kafka 3, programmatic API for caching, Kotlin 1.6 and a lot more!
ja_jp: Quarkus 2.6.0.Final リリース - SmallRye Reactive Messaging 3.13 と Kafka 3、キャッシュ用プログラマティック API、Kotlin 1.6 など、盛りだくさん!

source: Quarkus 2.6.1.Final released - Maintenance release
ja_jp: Quarkus 2.6.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.6.2.Final released - Maintenance release
ja_jp: Quarkus 2.6.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.6.3.Final released - Maintenance release
ja_jp: Quarkus 2.6.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.7.0.Final comes with an even better Quarkus CLI, an interactive terminal for dev mode, SmallRye Stork 1.0.0, an Oracle Reactive SQL Client extension and a ton of other things.
ja_jp: Quarkus 2.7.0.Finalには、さらに改良されたQuarkus CLI、開発モード用のインタラクティブターミナル、SmallRye Stork 1.0.0、Oracle Reactive SQL Clientエクステンション、その他多くのものが搭載されています。

source: Quarkus 2.7.0.Final released - Quarkus CLI maturing, Interactive terminal, Oracle Reactive SQL Client...
ja_jp: Quarkus 2.7.0.Final リリース - Quarkus CLIの成熟化、インタラクティブターミナル、Oracle Reactive SQL Client...

source: Quarkus 2.7.1.Final released - Maintenance release
ja_jp: Quarkus 2.7.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.7.2.Final released - Maintenance release
ja_jp: Quarkus 2.7.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.7.3.Final released - Maintenance release
ja_jp: Quarkus 2.7.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.7.4.Final released - Maintenance release
ja_jp: Quarkus 2.7.4.Finalリリース - メンテナンスリリース

source: Quarkus 2.7.5.Final released - Maintenance release
ja_jp: Quarkus 2.7.5.Finalリリース - メンテナンスリリース

source: Quarkus 2.8 introduces a new `QuarkusTransaction` API that offers more fine grained control over your transactions using a programmatic API.
ja_jp: Quarkus 2.8では、新しい `QuarkusTransaction` APIが導入され、プログラムAPIを使用してトランザクションをより細かく制御できるようになりました。

source: Quarkus 2.8.0.Final makes RESTEasy Reactive our default REST layer. It also upgrades to GraalVM 22.0 and brings many more refinements.
ja_jp: Quarkus 2.8.0.Final は、RESTEasy ReactiveをデフォルトのRESTレイヤーにしました。また、GraalVM 22.0にアップグレードし、さらに多くの改良を加えています。

source: Quarkus 2.8.0.Final released - New REST layer by default, GraalVM 22.0 and much more!
ja_jp: Quarkus 2.8.0.Final リリース - 新しいRESTレイヤーのデフォルト化、GraalVM 22.0、その他多数!

source: Quarkus 2.8.1.Final released - Maintenance release
ja_jp: Quarkus 2.8.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.8.2.Final released - Maintenance release
ja_jp: Quarkus 2.8.2.Finalリリース - メンテナンスリリース

source: Quarkus 2.8.3.Final released - Maintenance release
ja_jp: Quarkus 2.8.3.Finalリリース - メンテナンスリリース

source: Quarkus 2.9.0.Final released - WebAuthn extension, Compression support for Reactive Routes and RESTEasy Reactive and much more...
ja_jp: Quarkus 2.9.0.Final リリース - WebAuthnエクステンション、Reactive RoutesおよびRESTEasy Reactiveの圧縮サポート、その他多数...

source: Quarkus 2.9.1.Final released - Maintenance release
ja_jp: Quarkus 2.9.1.Finalリリース - メンテナンスリリース

source: Quarkus 2.9.2.Final released - Maintenance release
ja_jp: Quarkus 2.9.2.Finalリリース - メンテナンスリリース

source: Quarkus 3 continues the mission of making Java the preferred framework for Kubernetes-native development with new developer tools and improved performance.
ja_jp: Quarkus 3は、新しい開発者ツールとパフォーマンスの向上により、JavaをKubernetesネイティブ開発に適したフレームワークにするという使命を継続しています。

source: Quarkus 3 continues the tradition of propelling Java development by moving fast and providing a cutting-edge user experience with the latest technologies.
ja_jp: Quarkus 3は、迅速に最新のテクノロジーを駆使した最先端のユーザーエクスペリエンスを提供することで、Java開発を推進する伝統を継承しています。

source: Quarkus 3 enables Pact contract-based testing capability which has a significant impact on the development process for Quarkus developers. Quarkus with Pact, allows developers to easily integrate Pact into their testing and deployment workflows without any additional setup. This can help to save time and ensure that developers can focus on writing code.
ja_jp: Quarkus 3では、Pactの契約ベースのテスト機能が利用できるようになり、Quarkus開発者の開発プロセスに大きな影響を与えるようになりました。QuarkusとPactの組み合わせにより、開発者は、追加の設定なしに、Pactをテストとデプロイのワークフローに簡単に統合することができます。これにより、時間を節約し、開発者がコードを書くことに集中できるようになります。

source: Quarkus 3 has landed.
ja_jp: Quarkus 3 登場.

source: Quarkus 3 has updated to the latest Jakarta APIs, which includes a community alignment around the new “jakarta.*” package names. We know this is a big change, so In order to make migrating as smooth as possible, we included an automated update tool to minimize your effort. Learn more about <a href="https://quarkus.io/blog/quarkus-3-0-final-released/#upgrading">migrating to Jakarta EE API’s</a>.
ja_jp: Quarkus 3は、最新のJakarta APIにアップデートされ、新しい “jakarta.*” パッケージ名に関するコミュニティの調整も含まれています。これは大きな変化であるため、できるだけスムーズに移行できるように、自動アップデートツールを導入し、労力を最小限に抑えています。<a href="https://ja.quarkus.io/blog/quarkus-3-0-final-released/#upgrading">Jakarta EE APIへの移行</a>の詳細についてはこちらをご覧ください。

source: Quarkus 3 includes a new and improved <a href="https://quarkus.io/guides/dev-ui">Dev UI</a> with a new look and feel that is more extensible. You can access the Dev UI at <code>http://localhost:8080/q/dev</code>
ja_jp: Quarkus 3には、より拡張性の高い新しいルック＆フィールで改良された<a href="https://ja.quarkus.io/guides/dev-ui">Dev UI</a>が含まれています。Dev UIには、<code>http://localhost:8080/q/dev</code>からアクセスできます

source: Quarkus 3.0 feature icons
ja_jp: Quarkus 3.0の機能アイコン

source: Quarkus 3.0 has a new update tool that radically simplifies updating your projects to the latest version of Quarkus.
ja_jp: Quarkus 3.0には、プロジェクトをQuarkusの最新バージョンにアップデートすることを根本的に簡素化する、新しいアップデートツールがあります。

source: Quarkus 3.0 introduced breaking changes on the configuration.
ja_jp: Quarkus 3.0では、設定に大きな変更が加えられました。

source: Quarkus 3.0 is based on Jakarta EE 10 and, as you can expect, it is not the only change. This version comes packed with new features and enhancements that we implemented during this period.
ja_jp: Quarkus 3.0はJakarta EE 10をベースにしていますが、ご想像の通り、変更点はそれだけではありません。このバージョンには、この期間に実装した新機能や機能強化が満載です。

source: Quarkus 3.0 is the result of a lot of work and dedication from the community. Quarkus continues to be an Open Source stack to write Java applications offering unparalleled startup time, memory footprint, and developer experience.
ja_jp: Quarkus 3.0は、コミュニティによる多くの努力と献身的な取り組みの結果です。Quarkusは、Javaアプリケーションを書くためのオープンソーススタックであり続け、比類のない起動時間、メモリフットプリント、開発者体験を提供します。

source: Quarkus 3.0 now has a new Dev UI that is more extensible and easier to use. It also has a new and much-improved look and feel.
ja_jp: Quarkus 3.0では、新しいDev UIが採用され、より拡張性が高く、使いやすくなっています。また、ルック＆フィールも新しくなり、大幅に改善されました。

source: Quarkus 3.0, our new major release, is here!
ja_jp: 新しいメジャーリリースであるQuarkus 3.0が登場しました！

source: Quarkus 3.0.0.CR1 released
ja_jp: Quarkus 3.0.0.CR1 リリース

source: Quarkus 3.20.5 released - LTS maintenance release
ja_jp: Quarkus 3.20.5 リリース - LTS メンテナンスリリース

source: Quarkus 3.20.6 released - LTS maintenance release
ja_jp: Quarkus 3.20.6 リリース - LTS メンテナンスリリース

source: Quarkus 3.27 (latest LTS) implements the following Specifications:
ja_jp: Quarkus 3.27 (最新の LTS) は以下の仕様を実装しています。

source: Quarkus 3.27.2 released - LTS maintenance release
ja_jp: Quarkus 3.27.2 がリリースされました - LTS メンテナンスリリース

source: Quarkus 3.27.3 released - LTS maintenance release
ja_jp: Quarkus 3.27.3 がリリースされました - LTS メンテナンスリリース

source: Quarkus 3.30.6 - Maintenance release
ja_jp: Quarkus 3.30.6 - メンテナンスリリース

source: Quarkus 3.30.7 - Maintenance release
ja_jp: Quarkus 3.30.7 - メンテナンスリリース

source: Quarkus 3.30.8 - Maintenance release
ja_jp: Quarkus 3.30.8 - メンテナンスリリース

source: Quarkus 3.31 - Full Java 25 support, Quarkus Maven packaging, Panache Next, and more!
ja_jp: Quarkus 3.31 - フルJava 25サポート、Quarkus Mavenパッケージング、Panache Next、その他！

source: Quarkus 3.31 adds full support for Java 25, including Java 25 runtime images and native image builds with Mandrel.
ja_jp: Quarkus 3.31は、Java 25ランタイムイメージおよびMandrelを使用したネイティブイメージビルドを含む、Java 25のフルサポートを追加します。

source: Quarkus 3.31 comes with a LOT of new features and improvements:
ja_jp: Quarkus 3.31には、多くの新機能と改善が含まれています:

source: Quarkus 3.31 upgrades Hibernate ORM to 7.2, Hibernate Reactive to 3.2, Hibernate Search to 8.2, and the Elasticsearch/OpenSearch clients and servers to 9.2/3.3 respectively.
ja_jp: Quarkus 3.31は、Hibernate ORMを7.2、Hibernate Reactiveを3.2、Hibernate Searchを8.2、Elasticsearch/OpenSearchクライアントおよびサーバーをそれぞれ9.2/3.3にアップグレードします。

source: Quarkus 3.31 will be released at the end of the month.
ja_jp: Quarkus 3.31 は今月末にリリースされる予定です。

source: Quarkus 3.31 will be released next week. It comes with two months of work so expect many new features and improvements!
ja_jp: Quarkus 3.31 は来週リリースされます。2か月にわたる作業の成果ですので、多数の新機能と改善が期待されます！

source: Quarkus 3.31.2 - Maintenance release
ja_jp: Quarkus 3.31.2 - メンテナンスリリース

source: Quarkus 3.31.3 - Maintenance release
ja_jp: Quarkus 3.31.3 - メンテナンスリリース

source: Quarkus 3.31.4 - Maintenance release
ja_jp: Quarkus 3.31.4 - メンテナンスリリース

source: Quarkus 3.32 - Project Leyden integration, more graceful shutdown, automatic Consul registration and more!
ja_jp: Quarkus 3.32 - Project Leyden の統合、より優雅なシャットダウン、自動 Consul 登録など！

source: Quarkus 3.32 also delivers several significant improvements and new features:
ja_jp: Quarkus 3.32 は、いくつかの重要な改善点と新機能も提供します。

source: Quarkus 3.32 includes the first version of our end-to-end Leyden integration. Let's take a closer look at how it works.
ja_jp: Quarkus 3.32 には、エンドツーエンドの Leyden 統合の最初のバージョンが含まれています。その仕組みを詳しく見ていきましょう。

source: Quarkus 3.32.2 - Maintenance release
ja_jp: Quarkus 3.32.2 - メンテナンスリリース

source: Quarkus 3.32.3 - Maintenance release
ja_jp: Quarkus 3.32.3 - メンテナンスリリース

source: Quarkus 3.33 LTS - new LTS version
ja_jp: Quarkus 3.33 LTS - 新しいLTSバージョン

source: Quarkus 3.34 - Enhancements all around
ja_jp: Quarkus 3.34 - 全体的な機能強化

source: Quarkus 3.34.2 - Maintenance release
ja_jp: Quarkus 3.34.2 - メンテナンスリリース

source: Quarkus 3.34.3 - Maintenance release
ja_jp: Quarkus 3.34.3 - メンテナンスリリース

source: Quarkus 3.4.2 released - Maintenance release
ja_jp: Quarkus 3.4.2 リリース - メンテナンスリリース

source: Quarkus Adoption
ja_jp: Quarkus の採用

source: Quarkus Application Bootstrap
ja_jp: Quarkus アプリケーションブートストラップ

source: Quarkus Application configuration file
ja_jp: Quarkus アプリケーション設定ファイル

source: Quarkus Base Runtime Image
ja_jp: Quarkusベースランタイムイメージ

source: Quarkus Benefits
ja_jp: Quarkusの利点

source: Quarkus Build Time Principle
ja_jp: Quarkus ビルド時原則

source: Quarkus CLI and the Maven and Gradle plugins now have the ability to `deploy` Quarkus applications.
ja_jp: Quarkus CLIとMavenおよびGradleプラグインに、 Quarkusアプリケーションを `deploy` する機能が追加されました。

source: Quarkus CLI commands and development Certificate Authority
ja_jp: Quarkus CLI コマンドと開発用認証局

source: Quarkus CXF to 3.33.0 - see https://docs.quarkiverse.io/quarkus-cxf/dev/release-notes/3.33.0.html[release notes]
ja_jp: Quarkus CXF を 3.33.0 に - https://docs.quarkiverse.io/quarkus-cxf/dev/release-notes/3.33.0.html[リリースノート] を参照

source: Quarkus CXF was also updated to 3.32. Since we forgot to include the 3.31.1 release notes in previous Quarkus announcements, you can now read both sets of notes: https://docs.quarkiverse.io/quarkus-cxf/dev/release-notes/3.31.1.html[3.31.1] and https://docs.quarkiverse.io/quarkus-cxf/dev/release-notes/3.32.0.html[3.32.0].
ja_jp: Quarkus CXF も 3.32 に更新されました。 以前の Quarkus の発表に 3.31.1 のリリースノートを含めるのを忘れていたため、両方のリリースノートを読むことができます: https://docs.quarkiverse.io/quarkus-cxf/dev/release-notes/3.31.1.html[3.31.1]および https://docs.quarkiverse.io/quarkus-cxf/dev/release-notes/3.32.0.html[3.32.0]。

source: Quarkus Chicory brings the power of the Chicory WebAssembly runtime to Quarkus applications. Here we will see how the popular Go-based Google CEL library is integrated to implement a Kubernetes style CEL validator.
ja_jp: Quarkus Chicory は、Chicory WebAssembly ランタイムのパワーを Quarkus アプリケーションにもたらします。ここでは、人気の高い Go ベースの Google CEL ライブラリーを統合し、Kubernetes スタイルの CEL バリデーターを実装する方法を見ていきます。

source: Quarkus Code Snippets
ja_jp: Quarkusコードスニペット

source: Quarkus Conditional Extension Dependencies
ja_jp: Quarkus条件付きエクステンション依存関係

source: Quarkus Core releases happen constantly and keeping up with the latest changes before a release is performed is crucial. Quarkiverse extensions are built daily against the latest https://github.com/quarkusio/quarkus[Quarkus core] using the https://github.com/quarkusio/quarkus-ecosystem-ci[Quarkus Ecosystem CI] and listed in the https://status.quarkus.io/[Quarkus Status] page.
ja_jp: Quarkusコアのリリースは常に行われており、リリースを実行する前に最新の変更点を把握しておくことは非常に重要です。Quarkiverseのエクステンションは、Quark https://github.com/quarkusio/quarkus-ecosystem-ci[us Ecosystem CI]を使用して最新の https://github.com/quarkusio/quarkus[Quarkusコア]に対して毎日ビルドされ、Quark https://status.quarkus.io/[usのステータス]ページに表示されます。

source: Quarkus DI solution (also called ArC) is based on the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window="_blank"] specification. However, it is not a full CDI implementation verified by the TCK. Only a subset of the CDI features is implemented - see also <<supported_features,the list of supported features>> and <<limitations,the list of limitations>>.
ja_jp: Quarkus DI ソリューション (ArC とも呼ばれます) は https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0, window="_blank"] 仕様に基づいています。ただし、これは TCK によって検証された完全な CDI 実装ではありません。CDI 機能のサブセットのみが実装されています。以下も合わせて参照下さい: <<supported_features,the list of supported features>> および <<limitations,the list of limitations>>。

source: Quarkus DI solution (also called ArC) is based on the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta Contexts and Dependency Injection 4.1, window="_blank"] specification. It implements the CDI Lite specification, with selected improvements on top, and passes the CDI Lite TCK. It does not implement CDI Full. See also <<supported_features_and_limitations,the list of supported features and limitations>>. Most of the existing CDI code should work just fine but there are some small differences which follow from the Quarkus architecture and goals.
ja_jp: Quarkus DI ソリューション (ArC とも呼ばれる) は、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta コンテキストと依存性の注入 4.1, window="_blank"] 仕様に基づいています。 CDI Lite 仕様を実装し、その上に厳選された改良を加え、CDI Lite TCK に合格しました。 CDI Full は実装されていません。 <<supported_features_and_limitations,the list of supported features and limitations>> も参照してください。 既存の CDI コードのほとんどは問題なく動作するはずですが、Quarkus のアーキテクチャーと目標に起因する小さな違いがいくつかあります。

source: Quarkus DI solution is based on the [Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) specification.
ja_jp: Quarkus DIソリューションは、[Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) 仕様に基づきます。

source: Quarkus DI solution is based on the [Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) specification. This guide explains the basics of CDI.
ja_jp: QuarkusのDIソリューションは、 [Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec )仕様に基づいています。このガイドでは、CDIの基本を説明します。

source: Quarkus DI solution is based on the [Jakarta Contexts and Dependency Injection 4.0](https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html) specification.
ja_jp: Quarkus DIソリューションは、[Jakarta Contexts and Dependency Injection 4.0](https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html) 仕様に基づいています。

source: Quarkus DI solution is based on the [Jakarta Contexts and Dependency Injection 4.1](https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html) specification.
ja_jp: Quarkus DIソリューションは、[Jakarta Contexts and Dependency Injection 4.1](https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html)仕様に基づいています。

source: Quarkus Dev UI defaults to English. If the user’s browser locale is supported, that locale becomes the active default. Users may also manually change the locale from the Dev UI settings dialog.
ja_jp: Quarkus Dev UI はデフォルトで英語です。ユーザーのブラウザのロケールがサポートされている場合、そのロケールがアクティブなデフォルトになります。ユーザーは、Dev UI の設定ダイアログから手動でロケールを変更することもできます。

source: Quarkus Dev UI is a developer-friendly user interface that comes to life when you run your application in development mode (`./mvnw quarkus:dev`). It serves as a powerful portal for exploring, debugging, and interacting with your application - all while it's running - with zero code changes or restarts.
ja_jp: Quarkus Dev UI は、アプリケーションを開発モード (`./mvnw quarkus:dev`) で実行したときに起動する、開発者に優しいユーザーインターフェースです。これは、コードを変更したり再起動したりすることなく、アプリケーションの実行中に、アプリケーションの探索、デバッグ、対話を行うための強力なポータルとして機能します。

source: Quarkus Dev UI supports full internationalization (i18n). To enable this in your extension, you must externalize all user-visible text into translation files.
ja_jp: Quarkus Dev UI は完全な国際化 (i18n) をサポートしています。これをエクステンションで有効にするには、すべてのユーザーに表示されるテキストを翻訳ファイルに外部化する必要があります。

source: Quarkus Development
ja_jp: Quarkus 開発

source: Quarkus Extension Maven Plugin
ja_jp: Quarkus エクステンション Maven プラグイン

source: Quarkus Extension Registry
ja_jp: Quarkusエクステンションレジストリ

source: Quarkus Extension Registry Client Configuration
ja_jp: Quarkus Extensionのレジストリクライアント設定

source: Quarkus Extension for Apache Kafka
ja_jp: Apache Kafka のための Quarkus エクステンション

source: Quarkus Extension for Apache Pulsar
ja_jp: Apache Pulsar のための Quarkus エクステンション

source: Quarkus Extension for Spring Cache API
ja_jp: Spring Cache APIのためのQuarkusエクステンション

source: Quarkus Extension for Spring DI API
ja_jp: Spring DI APIのためのQuarkusエクステンション

source: Quarkus Extension for Spring Data JPA API
ja_jp: Spring Data JPA API のための Quarkus エクステンション

source: Quarkus Extension for Spring Scheduling API
ja_jp: Spring Scheduling APIのためのQuarkus Extension

source: Quarkus Extension for Spring Security API
ja_jp: Spring Security API の Quarkus エクステンション

source: Quarkus Extension for Spring Web API
ja_jp: Spring Web APIのためのQuarkus エクステンション

source: Quarkus Extensions enabling Reactive
ja_jp: リアクティブを可能にするQuarkusエクステンション

source: Quarkus Funqy is part of Quarkus's serverless strategy and aims to provide a portable Java API to write functions deployable to various FaaS environments like AWS Lambda, Azure Functions, Google Cloud Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service.
ja_jp: Quarkus Funqy は、Quarkus のサーバーレス戦略の一部であり、AWS Lambda、Azure Functions、Google Cloud Functions、Knative、Knative Events（Cloud Events）などの様々な FaaS 環境にデプロイ可能なファンクションを書くためのポータブルな Java API を提供することを目的としています。また、スタンドアロンのサービスとしても使用することができます。
